Tekla Open API Reference for Tekla Structures 2025
ClashCheckData.Overlap Property
 Gets the overlap of the clash. Only applies to clashes of type CLASH_TYPE_CLASH.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Overlap { get; }
Public ReadOnly Property Overlap As Double
	Get
Property Value
Type: Double
See Also
Reference
ClashCheckData Class
Tekla.Structures.Model Namespace